app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" ASC
---
  def index
    @questions = Question.order(:created_at)

INSERT INTO "questions" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Who's on first?"], ["description", "Where am I?"], ["user_id", 1], ["created_at", "2015-03-24 17:03:11.711894"], ["updated_at", "2015-03-24 17:03:11.711894"]]
---
  def create
    @question = Question.new(question_params)
    if @question.save